"use strict";
//З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). Вивести на екран назву транспортного засобу, яким він може керувати.
//Крок 1. Введення необхідних даних
const nameDriverCategory = prompt('Введіть назву категорії водія: A, B чи C', 'А');
let result;
//Крок 2. Обчислення результатів та виведення
switch (nameDriverCategory.toUpperCase()) {
    case 'A':
        result = 'Мотоцикл';
        break;
    case 'B':
        result = 'Легковий автомобіль';
        break;
    case 'C':
        result = 'Вантажний автомобіль';
        break;
    default:
        result = 'Введена неправильна назва категорії водія. Спробуйте ще.';
        break;
}
document.write(result);
